ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/psrm/receiveClaim/ValidUpdateIncorrectReport.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2009/01/15/">
    <soapenv:Header/>
    <soapenv:Body>
        <ns:MFFordringIndberet_I>
            <ns:Kontekst>
                <tsk:HovedOplysninger xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/">
                    <tsk:TransaktionsID>52ea66ca-4778-4877-b2a2-0b99748eb4f0</tsk:TransaktionsID>
                    <tsk:TransaktionsTid>2016-12-28T11:14:18</tsk:TransaktionsTid>
                </tsk:HovedOplysninger>
            </ns:Kontekst>
            <ns:FordringhaverSystemIDStruktur>
                <ns:VirksomhedSENummer>111</ns:VirksomhedSENummer>
            </ns:FordringhaverSystemIDStruktur>
            <ns:MFLeveranceID>222</ns:MFLeveranceID>
            <ns:FordringAktionSamling>
                <ns:FordringAktion>
                    <ns:MFAktionKode>FEJLAGTIGHOVEDSTOLINDBERETNING</ns:MFAktionKode>
                    <ns:DMIFordringHaverID>444</ns:DMIFordringHaverID>
                    <ns:AktionValg>
                        <ns:MFFejlagtigHovedstolIndberetningStruktur>
                            <ns:DMIFordringEFIFordringID>555</ns:DMIFordringEFIFordringID>
                            <ns:DMIFordringModtagelseDato>2017-01-31</ns:DMIFordringModtagelseDato>
                            <ns:MFAktionID>CHANGE_MFAktionID</ns:MFAktionID>
                            <ns:HoeringJournalNummer>666</ns:HoeringJournalNummer>
                            <ns:OpskrivningÅrsagStruktur>
                                <ns:FordringOpskrivningÅrsagBegr>777</ns:FordringOpskrivningÅrsagBegr>
                            </ns:OpskrivningÅrsagStruktur>
                            <ns:SagsbemærkningSamling>
                                <ns:MFNoteStruktur>
                                    <ns:MFNoteTekst>888</ns:MFNoteTekst>
                                </ns:MFNoteStruktur>
                            </ns:SagsbemærkningSamling>
                            <ns:DokumentSamling>
                                <ns:MFDokumentStruktur>
                                    <ns:DPDokumentArt>ANDET</ns:DPDokumentArt>
                                    <ns:DokumentFormatValg>
                                        <ns:DokumentFil>
                                            <ns:DokumentFilType>dokumentFilType</ns:DokumentFilType>
                                            <ns:DokumentFilIndhold>cid:1299157957555</ns:DokumentFilIndhold>
                                        </ns:DokumentFil>
                                    </ns:DokumentFormatValg>
                                </ns:MFDokumentStruktur>
                            </ns:DokumentSamling>
                            <ns:FordringOprindeligBeløbStruktur>
                                <ns:ValutaKode>DKK</ns:ValutaKode>
                                <ns:EFIFordringOprindeligBeløb>999</ns:EFIFordringOprindeligBeløb>
                            </ns:FordringOprindeligBeløbStruktur>
                        </ns:MFFejlagtigHovedstolIndberetningStruktur>
                    </ns:AktionValg>
                </ns:FordringAktion>
            </ns:FordringAktionSamling>
        </ns:MFFordringIndberet_I>
    </soapenv:Body>
</soapenv:Envelope>